#!/bin/bash
# **********************************************************
# * Author : liangliangsu
# * Email : sll917@hotmail.com
# * Create time : 2022-10-09 16:29
# * Filename : rename_files.sh.sh
# **********************************************************
echo '(0)---------------------------------------------'
name=liangliangsu
echo ${name}
echo ${name} | wc -L
echo "${name}" | awk '{print length($0)}'
expr length "${name}"
echo ${#name}
: '
删除变量说明
变量				说明
${变量#匹配规则}                从头开始匹配，最短删除
${变量##匹配规则}               从头开始匹配，最长删除
${变量%匹配规则}                从尾开始匹配，最短删除
${变量%%匹配规则}               从尾开始匹配，最长删除
'
#1,$变量{变量#匹配规则}  从头开始匹配，最短删除；
echo '(1)---------------------------------------------'
demo=www.baidu.com
# 从头开始删除，*代表了所有，删除到. 这个符号结束（依靠最短匹配原则）
echo ${demo#}
echo ${demo#*.}
echo ${demo#*w}
echo ${demo#*t}
echo ${demo#*d}

#2,$(变量##匹配规则)  从头开始匹配，最长匹配（贪婪的方式）；
#什么叫贪婪匹配？
#比如这个语法，它会以贪吃蛇吃豆豆一样，一直持续匹配到第二个一样的结束符。
echo '(2)---------------------------------------------'
echo ${demo##*.}

echo '(3)---------------------------------------------'
#3,${变量%匹配规则}   从尾开始匹配，最短删除；
#4,${变量%%匹配规则}   从尾开始匹配，最长删除（贪婪模式）；
echo ${demo%%.*}
echo ${demo%.*}

#for file in ` ls -d $(ls --file-type | grep ".*/$") -l `  #批量修改目录名
#for file in ` ls -d $(ls --file-type | grep ".*[^/]$") -l ` #批量修改文件名
#do
#	mv ${file}  ` echo $file | sed 's/shell_//g' `   #sed命令进行文件名替换
#done
