#!/bin/bash
# **********************************************************
# * Author : liangliangSu
# * Email : sll917@hotmail.com
# * Create time : 2022-10-20 18:59
# * Filename : 13awk_设置变量.sh
# **********************************************************
#awk -v # 设置变量
#实例：
echo '(1)-----------------------完美分割线--------------------------------'
awk -va=1 '{print $1,$1+a}' test.txt
#2 3
#3 4
#This's 1
#10 11
echo '(2)-----------------------完美分割线--------------------------------'
awk -va=1 -vb=s '{print $1,$1+a,$1b}' test.txt
#2 3 2s
#3 4 3s
#This's 1 This'ss
#10 11 10s
