#!/bin/bash
# **********************************************************
# * Author : liangliangsu
# * Email : sll917@hotmail.com
# * Create time : 2022-10-19 10:10
# * Filename : 06awk_匹配代码块.sh
# **********************************************************
: '
/匹配代码块
/纯字符匹配   !//纯字符不匹配   ~//字段值匹配    !~//字段值不匹配   ~/a1|a2/字段值匹配a1或a2  
'
echo '(1)-----------------------完美分割线--------------------------------'
awk '/sll/' /etc/passwd

echo '(2)-----------------------完美分割线--------------------------------'
awk '/sll/{print }' /etc/passwd

echo '(3)-----------------------完美分割线--------------------------------'
awk '/sll/{print $0}' /etc/passwd  #三条指令结果一样

echo '(4)-----------------------完美分割线--------------------------------'
awk '!/sll/{print $0}' /etc/passwd  #输出不匹配sll的行

echo '(5)-----------------------完美分割线--------------------------------'
awk '/sll|mail/{print}' /etc/passwd

echo '(6)-----------------------完美分割线--------------------------------'
awk '!/sll|mail/{print}' /etc/passwd

echo '(7)-----------------------完美分割线--------------------------------'
awk -F: '/mail/,/sll/{print}' /etc/passwd         #区间匹配

echo '(8)-----------------------完美分割线--------------------------------'
awk '/[2][7][7]*/{print $0}' /etc/passwd          #匹配包含27为数字开头的行，如27，277，2777...

echo '(9)-----------------------完美分割线--------------------------------'
awk -F: '$1~/mail/{print $1}' /etc/passwd           #$1匹配指定内容才显示

echo '(10)-----------------------完美分割线--------------------------------'
awk -F: '{if($1~/mail/) print $1}' /etc/passwd     #与上面相同

echo '(11)-----------------------完美分割线--------------------------------'
awk -F: '$1!~/mail/{print $1}' /etc/passwd          #不匹配

echo '(12)-----------------------完美分割线--------------------------------'
awk -F: '$1!~/mail|sll/{print $1}' /etc/passwd
