#!/bin/bash
# **********************************************************
# * Author : liangliangsu
# * Email : sll917@hotmail.com
# * Create time : 2022-10-19 10:50
# * Filename : 09awk_逻辑运算符.sh
# **********************************************************
#逻辑运算符
#&&　||

echo '(1)-----------------------完美分割线--------------------------------'
awk -F: '$1~/mail/ && $3>7 {print }' /etc/passwd         #逻辑与，$1匹配mail，并且$3>7
echo '(2)-----------------------完美分割线--------------------------------'
awk -F: '{if($1~/mail/ && $3>7) print }' /etc/passwd
echo '(3)-----------------------完美分割线--------------------------------'
awk -F: '$1~/mail/ || $3>1000 {print }' /etc/passwd       #逻辑或
echo '(4)-----------------------完美分割线--------------------------------'
awk -F: '{if($1~/mail/ || $3>1000) print }' /etc/passwd
echo '(5)-----------------------完美分割线--------------------------------'
#过滤第一列大于2并且第二列等于’Are’的行:
awk '$1>2 && $2=="Are" {print $1,$2,$3}' test.txt    #命令
