#!/bin/bash
# **********************************************************
# * Author : liangliangSu
# * Email : sll917@hotmail.com
# * Create time : 2023-02-05 00:05
# * Filename : 03bash基本特性.sh
# **********************************************************
# 5.1 命令和文件自动补全
# Tab只能补全命令和文件 （RHEL6/Centos6）

# 5.2 常见的快捷键
: '
^c               终止前台运行的程序
^z                将前台运行的程序挂起到后台
^d               退出 等价exit
^l               清屏 
^a |home      光标移到命令行的最前端
^e |end      光标移到命令行的后端
^u               删除光标前所有字符
^k               删除光标后所有字符
^r                搜索历史命令
'

# 5.3 常用的通配符（重点）
: <<!
*    				匹配0或多个任意字符
?    				匹配任意单个字符
[list]    			匹配[list]中的任意单个字符
[!list] 			匹配除list中的任意单个字符
{string1,string2,...}：		匹配string1,string2或更多字符串
!

#举例：
echo '(1)-----------------------完美分割线--------------------------------'
touch file{1..3}
touch file{1..13}.jpg
echo '(2)-----------------------完美分割线--------------------------------'
ls -l file*
ls -l *.jpg

#i 5.4 bash中的引号（重点）
: <<!
双引号 "" :会把引号的内容当成整体来看待，允许通过符号引用其他变量值</li><li>
单引号 ′′ :会把引号的内容当成整体来看待，禁止引用其他变量值，shell中特殊符号都被视为普通字符</li><li>
反撇号`` :反撇号和()一样，引号或括号里的命令会优先执行，如果存在嵌套，反撇号不能用
!
echo '(3)-----------------------完美分割线--------------------------------'
echo "$(hostname)"
echo '$(hostname)'
echo "hello world"
echo 'hello world'
echo $(date +%F)
echo `echo $(date +%F)`
echo `date +%F`
echo `echo `date +%F``
echo $(echo `date +%F`)
