#!/bin/bash
# **********************************************************
# * Author : liangliangSu
# * Email : sll917@hotmail.com
# * Create time : 2023-01-29 08:45
# * Filename : 01脚本注释1.sh
# **********************************************************
#!/bin/bash
# **********************************************************
# * Author : liangliangSu
# * Email : sll917@hotmail.com
# * Create time : 2023-01-29 08:45
# * Filename : 01脚本注释1.sh
# **********************************************************
: 'shell脚本——注释（单行注释 多行注释）
以"#"开头的行就是注释，会被解释器忽略。
#--------------------------------------------
# 这是一个注释
# author：菜鸟教程
# site：www.runoob.com
# slogan：学的不仅是技术，更是梦想！
#--------------------------------------------
##### 用户配置区 开始 #####
#
#
# 这里可以添加脚本描述信息
#
#
##### 用户配置区 结束  #####
'
#多行注释

#方法一：
: <<!
#被注释的内容
!

#方法二：
: '
#被注释的内容
'
#方法三：
#if false;then
##被注释的内容
#fi

#方法四：
: <<任意字符或者数字
#被注释的内容
任意字符或者数字

