#!/bin/bash
#======================================
# File name:shell_23case语句.sh
# Author:liangliangSu
# Email:sll917@hotmail.com
# Date of writing:2022-10-07 18:54
#======================================
#!/bin/bash
case $1 in
1)
 echo "2021年全国城市房价排行第1是:深圳  "
;;
2)
 echo "2021年全国城市房价排行第2是:北京  "
;;
3)
 echo "2021年全国城市房价排行第3是:上海  "
;;
4)
 echo "2021年全国城市房价排行第4是:广州  "
;;
5)
 echo "2021年全国城市房价排行第5是:杭州  "
;;
6)
 echo "2021年全国城市房价排行第6是:三亚  "
;;
7)
 echo "2021年全国城市房价排行第7是:南京  "
;;
8)
 echo "2021年全国城市房价排行第8是:天津  "
;;
9)
 echo "2021年全国城市房价排行第9是:珠海  "
;;
*)
 echo "2021年全国城市房价排行第10是:东莞 "
;;
esac
