#!/bin/bash
# **********************************************************
# * Author : liangliangsu
# * Email : sll917@hotmail.com
# * Create time : 2022-10-18 15:10
# * Filename : 03awk_F指定分隔符.sh
# **********************************************************
: '
-F指定分隔符 -F相当于内置变量FS, 指定分割字符
1指指定分隔符后，第一个字段，3第三个字段， \t是制表符
一个或多个连续的空格或制表符看做一个定界符，即多个空格看做一个空格
'
echo '(1)-----------------------完美分割线--------------------------------'
awk -F":" '{print $1}'  /etc/passwd

echo '(2)-----------------------完美分割线--------------------------------'
awk -F":" '{print $1$3}'  /etc/passwd                       #1与3相连输出，不分隔

echo '(3)-----------------------完美分割线--------------------------------'
awk -F":" '{print $1,$3}'  /etc/passwd                       #多了一个逗号，1与3使用空格分隔

echo '41)-----------------------完美分割线--------------------------------'
awk -F":" '{print $1" "$3}'  /etc/passwd                  #1与3之间手动添加空格分隔

echo '(5)-----------------------完美分割线--------------------------------'
awk -F":" '{print "Username:" $1 "\t\t Uid:"$3 }' /etc/passwd       #自定义输出  

echo '(6)-----------------------完美分割线--------------------------------'
awk -F: '{print NF}' /etc/passwd                                #显示每行有多少字段

echo '(7)-----------------------完美分割线--------------------------------'
awk -F: '{print $NF}' /etc/passwd                              #将每行第NF个字段的值打印出来

echo '(8)-----------------------完美分割线--------------------------------'
 awk -F: 'NF==7 {print }' /etc/passwd                       #显示只有4个字段的行

echo '(9)-----------------------完美分割线--------------------------------'
awk -F: 'NF>2{print $0}' /etc/passwd                       #显示每行字段数量大于2的行

echo '(10)-----------------------完美分割线--------------------------------'
awk '{print NR,$0}' /etc/passwd                                 #输出每行的行号

awk -F: '{print NR,NF,$NF"\t",$0}' /etc/passwd  #依次打印行号，字段数，最后字段值，制表符，每行内容

echo '(11)-----------------------完美分割线--------------------------------'
awk -F: 'NR==5{print}'  /etc/passwd                         #显示第5行

echo '(12)-----------------------完美分割线--------------------------------'
awk -F: 'NR==5 || NR==6{print}'  /etc/passwd       #显示第5行和第6行

echo '(13)-----------------------完美分割线--------------------------------'
route -n|awk 'NR!=1{print}'                                       #不显示第一行

echo '(14)-----------------------完美分割线--------------------------------'
awk -F '[ ,]'  '{print $1,$2,$5}' test.txt #使用多个分隔符.先使用空格分割，后对分割结果再使用","分割

echo '(15)-----------------------完美分割线--------------------------------'
cat /etc/passwd | awk '{FS=":"} $3 < 10 {print $1 "\t " $3}'

echo '(16)-----------------------完美分割线--------------------------------'
cat /etc/passwd | awk 'BEGIN {FS=":"} $3 < 10 {print $1 "\t " $3}'
